{"Project": {"waxmuseum": {"name": "waxmuseum", "url": "/project/waxmuseum", "title": "Wax Museum", "dataEnd": "Dec 2019", "dateStart": "Sept 2019", "blurb": "This project uses laptop footage to turn off the laptop screen when I'm not looking at it.", "img": "0.png", "intro": "Two Problems. I don't know PyTorch, and my laptop battery keeps dying during lecture. The latter has easier solutions. I could lower my brightness, reduce non-essential usage, or remember to charge my laptop. However, I'm a bit of an AI geek and I had an unreasonable yet simple solution in mind: turn off the screen when I'm not looking at it, and turn it back on when I am. I just need a simple convolutional net to perform binary classification. This will stretch my battery life further, and give me a chance to learn PyTorch. Problems solved.", "custom": [{"header": "Weights and Biases", "body": "Weights and Biases is a new analytics platform for training neural networks. It's like TensorBoard, but better in functionality and easier to use. It allows you to compare runs effortlessly, sweep through hyperparameters, and display custom metrics. I used Weights and Biases in this project to find optimal hyperparameters like the learning rate, and to display performance metrics so I could pick the best model. I also displayed a bunch of activation maps, because they're really cool. :)"}], "gallery": [{"height": "480", "src": "0.png", "width": "480"}, {"height": "480", "src": "1.png", "width": "640"}], "howItWorks": "This network is a simple convolutional one, with about 4 layers. I use OpenCV to get frames from the webcam, and then run them through the network. I then use the past 3 readings to smooth the output. If the network says I'm looking away, then I dim the screen through the command line. Otherwise, I keep the screen lit. It's only slightly more complex than an if statement in an infinite loop.", "learned": ["Weights & Biases analytics", "Tuning hyperparameters", "PyTorch"], "links": ["https://github.com/SinclairHudson/wax-museum", "https://app.wandb.ai/sinclairhudson/waxmuseum?workspace=user-sinclairhudson"], "tags": ["Computer Vision", "PyTorch", "Weights & Biases", "OpenCV"], "video": null}, "ajax": {"name": "ajax", "title": "AJAX ASR", "dateStart": "Sept 2018", "dataEnd": "Feb 2019", "blurb": "Voice Recognition system built with Google Tensorflow.", "img": "0.jpg", "links": ["https://github.com/SinclairHudson/AJAX"], "tags": ["TensorFlow", "NLP", "NumPy", "Tensorboard", "Keras", "LSTM"], "gallery": [{"src": "0.jpg", "width": 320, "height": 320}, {"src": "1.jpg", "width": 1527, "height": 472}, {"src": "2.jpg", "width": 3264, "height": 4352}, {"src": "3.jpg", "width": 361, "height": 286}], "video": null, "url": "/project/ajax", "intro": "This is my oldest TensorFlow project, which all started with a frustration with a horrible voice recognition library. I decided to give it a shot myself, using Google TensorFlow. Currently, I have some parts working with a sub-optimal accuracy, and I'm looking into different models and methods to achieve great voice recognition. You can find all my code on my GitHub.\n", "learned": ["Implementing and testing sequence classification neural networks", "Google Tensorflow, NumPy, Pyaudio, and many other small libraries", "Patience", "A Research, Build, Test cycle to complete a project"], "custom": [], "howItWorks": "Currently, I've only trained a word classifier working, capable at differentiating 18 different words apart, with about 92% accuracy. The idea was to determine where the word breaks were, partition the sound file into words, and then classify from there.\n"}}, "Experience": {"wawanesa": {"name": "wawanesa", "blurb": "For my first co-op term, I was working in Communitech for the Wawanesa Insurance Innovation Lab.", "custom": [{"body": "My first proof of concept project was to create a system that helped a public relations team informed on the public’s opinions. Using Twitter’s API, I created a system that took tweets with a specific keyword and performed sentiment analysis on them. By storing the data in a database, the system is able to track Twitter user’s opinions on the keyword. The whole project was built in AWS with Serverless. I used AWS Lambda, DynamoDB, Comprehend, and API Gateway. My Node.js code tied all those systems together.", "header": "Twitter Sentiment Analysis"}, {"body": "I built a similar system for Instagram, but for a different purpose. A big issue in the insurance industry is fraud. Thankfully, quite a few people incriminate themselves on social media, by posting things that prove their claim is false. I designed a system that looks at a user’s instagram profile for posts relating to the claim, whether it be travel, automotive, etc. This data is retrieved with a flask application, and then sent off to a React frontend to be reviewed.", "header": "Instant Verification"}], "date-end": "August 2019", "date-start": "April 2019", "gallery": [{"height": "1", "src": "1.jpg", "width": "1"}, {"height": "4608", "src": "3.jpg", "width": "3456"}, {"height": "3456", "src": "2.jpg", "width": "4608"}, {"height": "4603", "src": "4.jpg", "width": "2457"}, {"height": "4608", "src": "5.jpg", "width": "3456"}, {"height": "4608", "src": "6.jpg", "width": "3456"}], "img": "1.jpg", "intro": "I couldn't have asked for a better first coop. My job was to build proof-of-concept projects for Wawanesa Insurance, exploring potential applications of new technologies to the insurance industry. I completed three major projects, and was exposed to so many different frameworks and technologies. I learned so much, and learned while building.", "learned": ["EC2, Sagemaker, Comprehend, Lambda, DynamoDB, API Gateway, ECR, Serverless", "React", "React Native", "Frontend", "NLP", "BERT and Transformers", "Jupyter Notebooks"], "tags": ["AWS", "React", "Node.js", "React Native", "Frontend", "NLP", "BERT and Transformers", "Jupyter Notebooks"], "title": "Wawanesa Insurance Developer", "url": "/experience/wawanesa", "video": null}, "huawei": {"name": "huawei", "blurb": "For my second coop, I worked at a self-driving lab for Huawei.", "custom": [{"header": "Summary Paper", "body": "Deep learning moves really fast. I was working on the SemanticKITTI dataset, which was only released in late 2019. Despite this, the competition gets weekly submissions, and more than a dozen papers have used it to evaluate their ideas. At Huawei, I was tasked with reading all these relevant papers, and condensing the main ideas into a single summary paper. This paper would be a great resource for anyone who wanted to enter the competition, and it would also be a nice reference for the team. We would be able to easily peruse the useful ideas of over a dozen papers, and incorporate them into our own experiments."}], "dataEnd": "April 2020", "dateStart": "Jan 2020", "gallery": [{"height": "320", "src": "0.jpg", "width": "320"}, {"height": "800", "src": "3d.gif", "width": "800"}, {"height": "480", "src": "confmatrix_30.png", "width": "640"}, {"height": "792", "src": "Figure_1.png", "width": "3253"}, {"height": "800", "src": "Figure_2.png", "width": "3775"}], "img": "0.jpg", "intro": "For four months in 2020, I worked at the Huawei autonomous vehicle lab in Markham. It was an amazing experience; I got to contribute to deep learning research, specifically in LiDAR segmentation. I kept up with current research, built and ran experiments, and even wrote a summary report.", "learned": ["Implementing models from scratch, based on research papers.", "The planning, execution, and documentation of dozens of deep learning experiments", "Analysing a dataset (SemanticKITTI) to create a good train/test/val split, and inform different experiments", "Reading a lot of research and summarizing it into useful contributions and interesting ideas."], "tags": ["Computer Vision", "PyTorch", "Research", "OpenCV", "LiDAR Segmentation"], "title": "LiDAR Perception Researcher at Huawei", "url": "/experience/huawei", "video": null}, "shad": {"name": "shad", "blurb": "A month long STEAM and Entrepreneurship program, at the University of New Brunswick.", "dataEnd": "July 2017", "dateStart": "July 2017", "gallery": [{"height": "720", "src": "hill.jpg", "width": "960"}, {"height": "1", "src": "cave.jpg", "width": "1"}, {"height": "774", "src": "hopewell.jpg", "width": "960"}, {"height": "526", "src": "pier.jpg", "width": "750"}, {"height": "1152", "src": "uni.jpg", "width": "2048"}], "img": "cave.jpg", "intro": "In the July of 2017, I attended the SHAD Program at The University of New Brunswick. SHAD is an educational summer program for exceptional youth across Canada, and it focuses on entrepreneurship. It was a month packed with fun and interesting experiences. We did robotics, went camping, and organized events. I also worked in a team of eight to create a mock business, which we pitched to ‘investors’ in a Shark Tank fashion.", "learned": ["Rapidly networking with 79 very interesting people.", "The basics of entrepreneurship in a team of 8.", "Teamwork and Leadership."], "tags": ["Entrepreneurship", "Leadership", "Networking"], "title": "SHAD UNB 2017", "url": "/experience/shad", "video": null}, "untether": {"name": "untether", "blurb": "For my third coop, I worked at Untether.AI. They're a startup that builds specialized cards for accelerated neural network inference.", "custom": [{"body": "A good portion of my time at Untether.AI was spent implementing Non-Max Suppression using only integer operations. That's so that NMS can be run on the runAI chip that Untether.AI is developing.", "header": "Non-Max Suppression"}, {"body": "This coop was completely remote, because of the COVID-19 pandemic. As a result, I don't have many pictures. :(", "header": "Uncertain Times"}], "dataEnd": "Dec 2020", "dateStart": "Sept 2020", "gallery": [{"height": "320", "src": "0.jpg", "width": "320"}], "img": "0.jpg", "intro": "I was on the neural networks team. We were responsible for converting TensorFlow networks into quantization-ready graphs, performing optimizations during the conversion.", "learned": ["Agile software development, fully integrated with GitHub Enterprise", "Quantization and optimization of neural network operations", "Designing, implementing, and evaluating product features", "Building software while considering the compiler, and the hardware that it will run on."], "tags": ["TensorFlow", "Python", "Computer Vision"], "title": "Software Developer at Untether.AI", "url": "/experience/untether", "video": null}, "truenorth": {"name": "truenorth", "blurb": "Technology for good conference in Kitchener, Ontario.", "dataEnd": "June 2019", "dateStart": "June 2019", "gallery": [{"height": "4608", "src": "1.jpg", "width": "3456"}, {"height": "4608", "src": "3.jpg", "width": "3456"}, {"height": "4608", "src": "2.jpg", "width": "3456"}], "img": "0.jpg", "intro": "I attended The True North Tech Conference with my friends from the Wawanesa Insurance innovation outpost. The conference was hosted by Communitech, in Kitchener. There conference focused around tech for good. Privacy, security, implications of new technology. ", "learned": ["Ethics in technology", "Providing digital solutions to social issues"], "tags": ["Ethics in Tech"], "title": "True North 2019", "url": "/experience/truenorth", "video": null}, "watonomous": {"name": "watonomous", "title": "Watonomous Design Team", "blurb": "Watonomous is the Self-Driving Car team at the University of Waterloo. We compete in the SAE autodrive challenge, striving to create an autonomous vehicle.", "custom": [{"body": "My current position in the team is that of a Technical Lead on the Perception Sub-team. I'm assigned a project, such as cyclist detection, road line detection, etc. I then lead a small group of core members to accomplish said task. This usually involves processing data, training a neural network, and evaluating it. I'm also responsible for keeping up to date on research in the machine vision space, and understanding how the whole watonomous codebase works. This means that I do a lot of code reviews, pull requests, and debugging.", "header": "Technical Lead"}], "dataEnd": "Present", "dateStart": "April 2019", "description": "I've worked on a few systems within perception. I experimented in railroad bar detection, and I've trained a YOLOv3 model on Traffic Light detection.", "gallery": [{"height": "4608", "src": "1.jpg", "width": "3456"}, {"height": "4608", "src": "3.jpg", "width": "3456"}, {"height": "4608", "src": "2.jpg", "width": "3456"}, {"height": "4608", "src": "4.jpg", "width": "3456"}], "img": "0.jpg", "intro": "I am currently on the Perception team, which is the team's front line. We take in the data from cameras, LIDAR, and radar and attempt to process that data to pull out meaningful features.", "learned": ["OpenCV masking, searching", "Training YOLOv3 on a traffic light dataset", "Collaboration and Version Control on a huge, highly integrated codebase", "ROS", "OpenVino", "Managing a small group of developers to complete a larger goal", "Code Reviewing", "Two-week build, test, deploy cycles with a large team and system"], "tags": ["Computer Vision", "TensorFlow", "OpenCV", "YOLO", "Keras"], "url": "/experience/watonomous", "video": null}, "camping": {"name": "camping", "title": "Camping Trips", "blurb": "One of my more intense hobbies is camping, specifically canoe tripping.", "custom": [{"header": "Most Recent Trip", "body": "My most recent trip was a 12-Day canoe trip down the Missinaibi River. We went from Dog Lake to Mattice, with a lot of rain and whitewater in between. Below is a video I made from the GoPro footage and pictures taken on the trip. I edited it all in Adobe Premiere Pro, and there's a longer version for those interested in all the whitewater."}], "dataEnd": "Present", "dateStart": "Super Early", "gallery": [{"height": "2988", "src": "1.jpg", "width": "5312"}, {"height": "3648", "src": "3.jpg", "width": "2736"}, {"height": "2448", "src": "2.jpg", "width": "2448"}, {"height": "960", "src": "4.jpg", "width": "540"}], "img": "0.jpg", "intro": "Ever since I was little, I was going on camping trips with my family; my father is an outdoor enthusiast. My family goes on a canoe trip just about every summer, and recently we’ve been doing whitewater paddling down various rivers in Northern Ontario. Through the Scouts Canada program, I’ve also been exposed to lightweight backpacking trips and winter camping.", "learned": ["Quick Decision making and communication skills", "Logistics and planning", "Teamwork and perseverance"], "tags": ["Planning", "Management", "Communication", "White Water Canoeing"], "url": "/experience/camping", "video": "https://www.youtube.com/embed/jbu0bRDEHXU"}}}